# RebarHandlePositionData Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarHandlePositionData Members
RebarHandlePositionData Class Methods Properties See Also
---
The RebarHandlePositionData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the RebarHandlePositionData |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetBarGeometry | Returns the geometry for a bar at the specified index currently in the Rebar. |
| GetDistributionPath | Gets the distribution path currently stored in the rebar. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetNumberOfBars | Gets the number of bars currently in the rebar. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetPosition | Sets the position for a specified handle. This information is set to the rebar after the API execution is finished successfully. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
RebarHandlePositionData Class
Autodesk.Revit.DB.Structure Namespace